###################################################################

# Created by write_sdc on Tue Jan 12 10:48:15 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {wb_data_out[31]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[30]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[29]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[28]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[27]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[26]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[25]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[24]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[23]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[22]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[21]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[20]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[19]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[18]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[17]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[16]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[15]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[14]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[13]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[12]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[11]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[10]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[9]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[8]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[7]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[6]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[5]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[4]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[3]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[2]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[1]}]
set_load -pin_load 3.40189 [get_ports {wb_data_out[0]}]
set_load -pin_load 3.40189 [get_ports {rom_address[31]}]
set_load -pin_load 3.40189 [get_ports {rom_address[30]}]
set_load -pin_load 3.40189 [get_ports {rom_address[29]}]
set_load -pin_load 3.40189 [get_ports {rom_address[28]}]
set_load -pin_load 3.40189 [get_ports {rom_address[27]}]
set_load -pin_load 3.40189 [get_ports {rom_address[26]}]
set_load -pin_load 3.40189 [get_ports {rom_address[25]}]
set_load -pin_load 3.40189 [get_ports {rom_address[24]}]
set_load -pin_load 3.40189 [get_ports {rom_address[23]}]
set_load -pin_load 3.40189 [get_ports {rom_address[22]}]
set_load -pin_load 3.40189 [get_ports {rom_address[21]}]
set_load -pin_load 3.40189 [get_ports {rom_address[20]}]
set_load -pin_load 3.40189 [get_ports {rom_address[19]}]
set_load -pin_load 3.40189 [get_ports {rom_address[18]}]
set_load -pin_load 3.40189 [get_ports {rom_address[17]}]
set_load -pin_load 3.40189 [get_ports {rom_address[16]}]
set_load -pin_load 3.40189 [get_ports {rom_address[15]}]
set_load -pin_load 3.40189 [get_ports {rom_address[14]}]
set_load -pin_load 3.40189 [get_ports {rom_address[13]}]
set_load -pin_load 3.40189 [get_ports {rom_address[12]}]
set_load -pin_load 3.40189 [get_ports {rom_address[11]}]
set_load -pin_load 3.40189 [get_ports {rom_address[10]}]
set_load -pin_load 3.40189 [get_ports {rom_address[9]}]
set_load -pin_load 3.40189 [get_ports {rom_address[8]}]
set_load -pin_load 3.40189 [get_ports {rom_address[7]}]
set_load -pin_load 3.40189 [get_ports {rom_address[6]}]
set_load -pin_load 3.40189 [get_ports {rom_address[5]}]
set_load -pin_load 3.40189 [get_ports {rom_address[4]}]
set_load -pin_load 3.40189 [get_ports {rom_address[3]}]
set_load -pin_load 3.40189 [get_ports {rom_address[2]}]
set_load -pin_load 3.40189 [get_ports {rom_address[1]}]
set_load -pin_load 3.40189 [get_ports {rom_address[0]}]
set_load -pin_load 3.40189 [get_ports ram_wr]
set_load -pin_load 3.40189 [get_ports {ram_dataout[31]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[30]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[29]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[28]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[27]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[26]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[25]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[24]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[23]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[22]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[21]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[20]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[19]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[18]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[17]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[16]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[15]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[14]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[13]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[12]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[11]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[10]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[9]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[8]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[7]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[6]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[5]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[4]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[3]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[2]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[1]}]
set_load -pin_load 3.40189 [get_ports {ram_dataout[0]}]
set_load -pin_load 3.40189 [get_ports {ram_address[31]}]
set_load -pin_load 3.40189 [get_ports {ram_address[30]}]
set_load -pin_load 3.40189 [get_ports {ram_address[29]}]
set_load -pin_load 3.40189 [get_ports {ram_address[28]}]
set_load -pin_load 3.40189 [get_ports {ram_address[27]}]
set_load -pin_load 3.40189 [get_ports {ram_address[26]}]
set_load -pin_load 3.40189 [get_ports {ram_address[25]}]
set_load -pin_load 3.40189 [get_ports {ram_address[24]}]
set_load -pin_load 3.40189 [get_ports {ram_address[23]}]
set_load -pin_load 3.40189 [get_ports {ram_address[22]}]
set_load -pin_load 3.40189 [get_ports {ram_address[21]}]
set_load -pin_load 3.40189 [get_ports {ram_address[20]}]
set_load -pin_load 3.40189 [get_ports {ram_address[19]}]
set_load -pin_load 3.40189 [get_ports {ram_address[18]}]
set_load -pin_load 3.40189 [get_ports {ram_address[17]}]
set_load -pin_load 3.40189 [get_ports {ram_address[16]}]
set_load -pin_load 3.40189 [get_ports {ram_address[15]}]
set_load -pin_load 3.40189 [get_ports {ram_address[14]}]
set_load -pin_load 3.40189 [get_ports {ram_address[13]}]
set_load -pin_load 3.40189 [get_ports {ram_address[12]}]
set_load -pin_load 3.40189 [get_ports {ram_address[11]}]
set_load -pin_load 3.40189 [get_ports {ram_address[10]}]
set_load -pin_load 3.40189 [get_ports {ram_address[9]}]
set_load -pin_load 3.40189 [get_ports {ram_address[8]}]
set_load -pin_load 3.40189 [get_ports {ram_address[7]}]
set_load -pin_load 3.40189 [get_ports {ram_address[6]}]
set_load -pin_load 3.40189 [get_ports {ram_address[5]}]
set_load -pin_load 3.40189 [get_ports {ram_address[4]}]
set_load -pin_load 3.40189 [get_ports {ram_address[3]}]
set_load -pin_load 3.40189 [get_ports {ram_address[2]}]
set_load -pin_load 3.40189 [get_ports {ram_address[1]}]
set_load -pin_load 3.40189 [get_ports {ram_address[0]}]
create_clock [get_ports clk]  -name my_clk  -period 2.7  -waveform {0 1.35}
set_clock_uncertainty 0.07  [get_clocks my_clk]
set_input_delay -clock my_clk  -max 0.5  [get_ports rst]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[31]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[30]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[29]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[28]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[27]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[26]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[25]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[24]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[23]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[22]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[21]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[20]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[19]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[18]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[17]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[16]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[15]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[14]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[13]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {rom_instr[0]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[31]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[30]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[29]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[28]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[27]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[26]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[25]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[24]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[23]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[22]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[21]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[20]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[19]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[18]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[17]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[16]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[15]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[14]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[13]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[12]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[11]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[10]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[9]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[8]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[7]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[6]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[5]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[4]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[3]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[2]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[1]}]
set_input_delay -clock my_clk  -max 0.5  [get_ports {ram_datain[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {wb_data_out[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {rom_address[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports ram_wr]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_dataout[0]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[31]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[30]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[29]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[28]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[27]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[26]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[25]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[24]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[23]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[22]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[21]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[20]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[19]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[18]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[17]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[16]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[15]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[14]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[13]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[12]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[11]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[10]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[9]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[8]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[7]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[6]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[5]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[4]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[3]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[2]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[1]}]
set_output_delay -clock my_clk  -max 0.5  [get_ports {ram_address[0]}]
